Repository: RolandDoyen/ClanManagerPublic
Catalog: ClanManager/ClanManager.Core/Resources/Resources.*.resx
Languages: fr

source: Active Clans
fr: Clans Actifs

source: All Clans
fr: Tous les Clans

# Back_Home
source: Back to home
fr: Retour à l'accueil

# Button_Activate
source: Activate
fr: Activer

# Button_Ban
source: Ban
fr: Bannir

# Button_Change_Role
source: Change Role
fr: Changer de rôle

# Button_Create
source: Create
fr: Créer

# Button_Deactivate
source: Deactivate
fr: Désactiver

# Button_Login
source: Login
fr: Se connecter

# Button_UnBan
source: Unban
fr: Dé-bannir

source: Clan Details
fr: Détails du Clan

source: Create Clan
fr: Créer Clan

# Enter_Clan_Description
source: Type de description for the Clan
fr: Entrez une description pour le Clan

source: Enter Clan Name
fr: Entrez le nom du Clan

source: Enter Clan TAG
fr: Entrez le TAG du Clan

# Enter_Password
source: Enter your Password
fr: Entre votre mot de passe

# Enter_User_Email
source: Enter your Email
fr: Entrez votre email

# Error
source: An error occurred while processing your request.
fr: Une erreur s’est produite lors du traitement de votre requête.

# Error404_1
source: Oops! The page you are looking for does not exist.
fr: Oups ! La page que vous cherchez n’existe pas.

# Error404_2
source: The link may be broken or the page may have been moved.
fr: Il se peut que le lien soit brisé ou que la page ait été déplacée.

# Error500_1
source: An internal error has occurred.
fr: Une erreur interne est survenue.

# Error500_2
source: We are working to fix it. Please try again later.
fr: Nous travaillons à la résoudre. Veuillez réessayer plus tard.

# Error_404
source: Page not found
fr: Page non trouvée

# Error_UserAlreadyExistsException
source: User already exists.
fr: L'utilisateur existe déjà.

source: Join
fr: Rejoindre

source: Leader
fr: Chef

source: Name
fr: Nom

# No_Clan_Available
source: No clans available.
fr: Pas de clans disponible.

source: No users available.
fr: Pas d'utilisateurs disponible.

source: Password
fr: Mot de passe

source: Quit
fr: Quitter

source: Register
fr: S'enregistrer

source: User Details
fr: Détails de l'utilisateur

# Error_User_Create_Controller
source: Error while creating account.
fr: Erreur lors de la création du compte.

# Error_UserNotFoundException
source: User not found.
fr: Utilisateur pas trouvé.

# Error_User_Detail_Controller
source: Error while retrieving user details.
fr: Erreur lors de la récupération des détails de l'utilisateur.

# Error_PasswordValidationException
source: Wrong Password. Please try again.
fr: Mot de passe incorrect.

# Error_User_Login_Controller
source: Error while user login.
fr: Erreur lors de la connexion.

# Error_User_ChangeRole_Controller
source: Error while changing User Role.
fr: Erreur lors du changement de Rôle de l'utilisateur.

# Error_RoleChangeException_SuperAdmin
source: Cannot change role of SuperAdmin.
fr: Impossible de changer le rôle de SuperAdmin.

# Error_User_ToggleBan_Controller
source: Error while ToggleBan user.
fr: Erreur lors du ToggleBan de l'utilisateur.

# Error_RoleChangeException_Invalid_Role
source: Invalid Role specified.
fr: Rôle spécifié invalide.

# Error_UserEmailNotFoundException
source: Email not found.
fr: Email pas trouvé.

# Error_RoleChangeException_To_SuperAdmin
source: Cannot set SuperAdmin role.
fr: Impossible de changer le rôle de l'utilisateur en SuperAdmin.

# Error_RoleChangeException_OwnRole
source: Cannot change own role.
fr: Impossible de changer son propre rôle.

# Error_User_List_Controller
source: Error while loading user list.
fr: Erreur lors du chargement de la liste des utilisateurs.

# Error_500
source: Internal server error
fr: Erreur interne du serveur

# Error_Admin_ResetDB
source: Error reseting Database.
fr: Erreur lors du reset de la base de données.

# Success_Admin_ResetDB
source: Database reseted successfully.
fr: Reset de la base de donnée effectuée avec succès.

# User_IsBanned
source: You are banned.
fr: Vous êtes banni.

# Error_NoSessionUserException
source: No User in Session.
fr: Pas d'utilisateur en session.

# Index_UserSide
source: User side
fr: Côté utilisateur

# Index_Title
source: Clan management website
fr: Gestionnaire de Clans

# Index_UserSide_Admin
source: The <strong>Admins</strong> have privileges to manage users and their roles.
fr: Les <strong>Admins</strong> ont des privilèges pour gérer les utilisateurs et leurs rôles.

# Index_ClanSide
source: Clan side
fr: Côté clan

# Index_ClanSide_You
source: You can <strong>create, edit and delete clans</strong>.
fr: Vous pouvez <strong>créer, éditer et supprimer des clans</strong>.

# Index_ClanSide_Users
source: Users can <strong>join or leave clans</strong> according to their preferences.
fr: Les utilisateurs peuvent <strong>rejoindre ou quitter des clans</strong> selon leurs préférences.

# Index_ClanSide_Leaders
source: The <strong>clan leaders</strong> have privileges to manage the members of their clan.
fr: Les <strong>leaders de clan</strong> ont des privilèges pour gérer les membres de leur clan.

# Index_TestAccounts
source: Test accounts
fr: Comptes de test

# Index_Doc
source: Project Documentation
fr: Documentation du projet

# Index_Doc_Txt
source: The <strong>UserBLL</strong> and <strong>UserController</strong> classes include an example of complete documentation with error handling, roles, and business logic behavior.
fr: Les classes <strong>UserBLL</strong> et <strong>UserController</strong> incluent un exemple de documentation complète avec gestion d’erreurs, rôles et comportements métier.

# Index_Attention_Text
source: A button allows you to reset the database in case of data issues. Use with caution.
fr: Un bouton permet de réinitialiser la base de données en cas de problème avec les données. À utiliser avec prudence.

# Error_ClanAlreadyExistsException
source: Clan with same Name and Tag already exists.
fr: Un clan avec le même Nom et Tag existe déjà.

# Error_Clan_Create_Controller
source: Error while creating Clan.
fr: Erreur lors de la création du Clan.

# Error_ClanNotFoundException
source: Clan not found.
fr: Clan pas trouvé.

# Error_Clan_Detail_Controller
source: Error while retrieving user details.
fr: Erreur lors de la récupération des détails du clan.

# Error_Clan_List_Controller
source: Error while loading clan list.
fr: Erreur lors du chargement de la liste des clans.

# Error_MemberAlreadyInClanException
source: Already clan member.
fr: Déjà membre du clan.

# Error_Clan_ToggleActive_Controller
source: Error while ToggleActive Clan.
fr: Erreur lors de ToggleActive du Clan.

# Error_Clan_Join_Controller
source: Error while joining clan.
fr: Erreur pour rejoindre le clan.

# Button_DeleteClan
source: Delete clan
fr: Supprimer le clan

# Error_ToggleBanException_Self
source: Cannot (un)ban yourself.
fr: Impossible de vous (un)ban vous-même.

# Error_MemberNotFoundException
source: Clan Member not found.
fr: Membre du clan pas trouvé.

# Error_WrongRoleException
source: You don't have a Role that allows you to do that action.
fr: Vous n'avez pas un Role vous permettant d'effectuer cette action.

# Error_ClanLeaderRemovalException
source: Clan Leader cannot be removed.
fr: Un Leader de Clan ne peut pas être enlevé.

# Error_SessionUserNotFoundException
source: Session user not found.
fr: Utilisateur en session pas trouvé.

# Error_ToggleBanException_ClanLeader
source: Cannot ban a Clan Leader.
fr: Impossible de ban un Clan Leader.

# Error_ToggleBanException_SuperAdmin
source: Cannot ban SuperAdmin.
fr: Impossible de ban SuperAdmin.

# Error_ToggleBanException_AdminByAdmin
source: Your role doesn't allow you to change that user Role.
fr: Votre Role ne vous permet pas de changer le Role de cet utilisateur.

# Error_NotClanLeaderException
source: Only Clan Leader can Delete Clan.
fr: Seul le Clan Leader peut supprimer le Clan.

# Success_User_Create_Controller
source: Account successfully created.
fr: Compte créé avec succès.

# Success_User_Login_Controller
source: Successfully logged in.
fr: Connecté avec succès.

# Success_User_Logout_Controller
source: Successfully logged out.
fr: Déconnecté avec succès.

# Success_User_ChangeRole_Controller
source: Role successfully changed.
fr: Rôle changé avec succès.

# Success_User_ToggleBan_Controller
source: ToggleBan successfull.
fr: ToggleBan effectué avec succès.

# Success_Clan_Create_Controller
source: Clan successfully created.
fr: Clan créé avec succès.

# Success_Clan_ToggleActive_Controller
source: ToggleActive successfull.
fr: ToggleActive effectué avec succès.

# Success_Clan_Join_Controller
source: Clan successfully joined.
fr: Clan rejoint avec succès.

# Success_Clan_RemoveMember_Controller
source: Member successfully removed from Clan.
fr: Membre retiré avec succès du Clan.

# Success_Clan_Delete_Controller
source: Clan successfully deleted.
fr: Clan supprimé avec succès.

# Error_Clan_RemoveMember_Controller
source: Error while removing Clan Member.
fr: Erreur lors de l'éviction du Membre du Clan.

# Error_Clan_Delete_Controller
source: Error while deleting Clan.
fr: Erreur lors de la suppression du Clan.

# Button_Remove
source: REMOVE
fr: ENLEVER

# Error_SessionUserMemberNotFoundException
source: Session User Member Not Found.
fr: Le Membre de l'utilisateur en session n'a pas été trouvé.

# Success_Clan_ChangeMemberRole_Controller
source: Member Clan Role changed successfully.
fr: Changement de Rôle du Membre de Clan effectué avec succès.

# Error_CannotChangeSameRoleException
source: Cannot change the Role of a Member with same Clan Role level.
fr: Impossible de change le Rôle de Clan d'un Membre avec le même Clan Rôle.

# Error_CannotChangeOwnRoleException
source: Cannot change Own Clan Role.
fr: Impossible de change son propre Rôle de Clan.

# Error_RoleChangeException_Invalid_ClanRole
source: Invalid Clan Role specified.
fr: Rôle de Clan spécifié invalide.

# Error_Clan_ChangeMemberRole_Controller
source: Error while changing Member Clan Role.
fr: Erreur lors du changement de Clan Role du Membre.

# Success_Clan_RemoveSelf_Controller
source: You successfuly left the clan.
fr: Vous avez quitté le clan avec succès.

# Error_ClanInactiveException
source: Cannot joint Inactive Clan.
fr: Impossible de rejoindre un Clan Inactif.

# Index_OtherAccounts_Text
source: You can also use the name before <strong>@example.com</strong> for every user, and use that same name as password.
fr: Vous pouvez également utiliser le nom avant <strong>@example.com</strong> pour chaque utilisateur, et utiliser ce même nom comme mot de passe.

source: My Clans
fr: Mes Clans

# Button_Edit
source: Edit
fr: Modifier

# Button_Save
source: Save
fr: Sauvegarder

# Button_Cancel
source: Cancel
fr: Annuler

# Error_Clan_UpdateDescription_Controller
source: Error while Updating Clan Description.
fr: Erreur lors de la mise-à-jour de la Description du Clan.

# Index_Description
source: Welcome to my clan management application. It allows you to organize groups, manage members, and define different access levels.
fr: Bienvenue sur mon application de gestion de clans. Elle permet d’organiser des groupes, gérer les membres et définir différents niveaux d’accès.

# Index_Main_Features
source: Main Features
fr: Fonctionnalités principales

# Index_UserSide_Connection
source: Login and use the site with different roles.
fr: Connexion et utilisation du site avec différents rôles.

source: Users
fr: Utilisateurs

source: Logout
fr: Se déconnecter

source: Login
fr: Se connecter

source: No Leader found
fr: Pas de Leader trouvé
